IRP/src/Documents/ProductionPlanningCorrection/ProductionPlanningCorrection.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProductionPlanningCorrection</name>
  <registerRecords>AccumulationRegister.MF_MaterialPlanning</registerRecords>
  <registerRecords>AccumulationRegister.MF_ProductionPlanning</registerRecords>
  <registerRecords>InformationRegister.MF_BillOfMaterials</registerRecords>
  <registerRecords>AccumulationRegister.MF_DetailingSupplies</registerRecords>
  <registerRecords>InformationRegister.T7010S_BillOfMaterials</registerRecords>
  <registerRecords>AccumulationRegister.R7030T_ProductionPlanning</registerRecords>
  <registerRecords>AccumulationRegister.R7020T_MaterialPlanning</registerRecords>
  <registerRecords>AccumulationRegister.R7010T_DetailingSupplies</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductionPlanning</name>
    <type>
      <types>DocumentRef.ProductionPlanning</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningPeriod</name>
    <type>
      <types>CatalogRef.PlanningPeriods</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>CatalogRef.ObjectStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovedDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Productions</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrentQuantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>BillOfMaterials</name>
      <type>
        <types>CatalogRef.BillOfMaterials</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>BillOfMaterials</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>BusinessUnit</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>ReleaseStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>MaterialStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>SemiproductStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>IsProduct</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsSemiproduct</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsMaterial</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsService</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InputID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OutputID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UniqueID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PlanningPeriod</name>
      <type>
        <types>CatalogRef.PlanningPeriods</types>
      </type>
    </attributes>
    <attributes>
      <name>BillOfMaterials</name>
      <type>
        <types>CatalogRef.BillOfMaterials</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>BasisUnit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>BasisQuantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>PlannedQuantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>PlannedBasisQuantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/ProductionPlanningCorrection/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;	
	If ThisObject.Status.Posting And Not ValueIsFilled(ThisObject.ApprovedDate) Then
		ThisObject.ApprovedDate = CurrentSessionDate();
	EndIf;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If ValueIsFilled(ThisObject.ProductionPlanning)
		And ThisObject.Date < ThisObject.ProductionPlanning.Date Then
			Cancel = True;
			MessageText = StrTemplate(R().MF_Error_004, 
			ThisObject.Date, 
			ThisObject.ProductionPlanning.Date);
			CommonFunctionsClientServer.ShowUsersMessage(MessageText, "Object.Date", "Object");
	EndIf;
	
	If Cancel = True Then
		Return;
	EndIf;
	
	Query = New Query();
	Query.Text = 
	"SELECT TOP 1
	|	MF_ProductionPlanningCorrection.Ref,
	|	MF_ProductionPlanningCorrection.Date
	|FROM
	|	Document.MF_ProductionPlanningCorrection AS MF_ProductionPlanningCorrection
	|WHERE
	|	MF_ProductionPlanningCorrection.ProductionPlanning = &ProductionPlanning
	|	AND NOT MF_ProductionPlanningCorrection.DeletionMark
	|	AND MF_ProductionPlanningCorrection.Posted
	|	AND MF_ProductionPlanningCorrection.Ref <> &Ref
	|	AND MF_ProductionPlanningCorrection.Date > &Date
	|ORDER BY
	|	MF_ProductionPlanningCorrection.Date DESC";
	Query.SetParameter("ProductionPlanning" , ThisObject.ProductionPlanning);
	Query.SetParameter("Ref", ThisObject.Ref);
	Query.SetParameter("Date", ThisObject.Date);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	If QuerySelection.Next() Then
		Cancel = True;
		MessageText = StrTemplate(R().MF_Error_005, 
		ThisObject.Date,   
		QuerySelection.Date);
		CommonFunctionsClientServer.ShowUsersMessage(MessageText, "Object.Date", "Object");
	EndIf;
EndProcedure

Procedure Posting(Cancel, PostingMode)
	PostingServer.Post(ThisObject, Cancel, PostingMode, ThisObject.AdditionalProperties);
EndProcedure

Procedure UndoPosting(Cancel)
	UndopostingServer.Undopost(ThisObject, Cancel, ThisObject.AdditionalProperties);
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	ThisObject.Status = MF_ObjectStatusesServer.GetDefaultStatus(ThisObject.Ref);
	
	If TypeOf(FillingData) = Type("Structure") Then
		If FillingData.Property("BasedOn") And FillingData.BasedOn = "MF_ProductionPlanning" Then
			ThisObject.ProductionPlanning = FillingData.ProductionPlanning;
			ThisObject.PlanningPeriod     = FillingData.PlanningPeriod;
			ThisObject.Company            = FillingData.Company;
			ThisObject.BusinessUnit       = FillingData.BusinessUnit;
			
			For Each Row In FillingData.Productions Do
				NewRow = ThisObject.Productions.Add();
				NewRow.Key             = String(New UUID());
				NewRow.Item            = Row.Item;
				NewRow.ItemKey         = Row.ItemKey;
				NewRow.Unit            = Row.Unit;
				NewRow.CurrentQuantity = Row.CurrentQuantity;
				NewRow.Quantity        = Row.CurrentQuantity;
				NewRow.BillOfMaterials = Row.BillOfMaterials;
				
				Parameters = New Structure("Key, Company, BillOfMaterials, PlanningPeriod, ItemKey, Unit, Quantity, CurrentQuantity");
				FillPropertyValues(Parameters, NewRow);
				Parameters.PlanningPeriod = FillingData.PlanningPeriod;
				Parameters.Company        = FillingData.Company;
				BillOfMaterialRows = MF_BillOfMaterialsCalculationsServer.FillBillOfMaterialsTableCorrection(Parameters);
				For Each RowBOM In BillOfMaterialRows Do
					NewRowBOM = ThisObject.BillOfMaterials.Add();
					FillPropertyValues(NewRowBOM, RowBOM);
				EndDo;
				
			EndDo;
		EndIf;
	EndIf;
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;	
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure
